In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {'Sede':['SP','SP','MG','MG','RJ','RJ','ES','ES'],
       'Vendedor':['Jorge','Ana','Tiago','Pedro','Raphaela','Guto','Maria','Carolina'],
       'Vendas':[2000,2500,3100,1200,1500,3900,2900,3900]}
df = pd.DataFrame(data)

In [3]:
df

  Sede  Vendedor  Vendas
0   SP     Jorge    2000
1   SP       Ana    2500
2   MG     Tiago    3100
3   MG     Pedro    1200
4   RJ  Raphaela    1500
5   RJ      Guto    3900
6   ES     Maria    2900
7   ES  Carolina    3900

In [10]:
df_sede = df.groupby('Sede')

In [11]:
df_sede.mean()

      Vendas
Sede
ES    3400.0
MG    2150.0
RJ    2700.0
SP    2250.0

In [12]:
df_sede.max()

      Vendedor  Vendas
Sede
ES       Maria    3900
MG       Tiago    3100
RJ    Raphaela    3900
SP       Jorge    2500

In [13]:
df_sede.describe()

     Vendas
      count    mean          std     min     25%     50%     75%     max
Sede
ES      2.0  3400.0   707.106781  2900.0  3150.0  3400.0  3650.0  3900.0
MG      2.0  2150.0  1343.502884  1200.0  1675.0  2150.0  2625.0  3100.0
RJ      2.0  2700.0  1697.056275  1500.0  2100.0  2700.0  3300.0  3900.0
SP      2.0  2250.0   353.553391  2000.0  2125.0  2250.0  2375.0  2500.0

In [14]:
df_sede.describe().unstack()

               Sede
Vendas  count  ES         2.000000
               MG         2.000000
               RJ         2.000000
               SP         2.000000
        mean   ES      3400.000000
               MG      2150.000000
               RJ      2700.000000
               SP      2250.000000
        std    ES       707.106781
               MG      1343.502884
               RJ      1697.056275
               SP       353.553391
        min    ES      2900.000000
               MG      1200.000000
               RJ      1500.000000
               SP      2000.000000
        25%    ES      3150.000000
               MG      1675.000000
               RJ      2100.000000
               SP      2125.000000
        50%    ES      3400.000000
               MG      2150.000000
               RJ      2700.000000
               SP      2250.000000
        75%    ES      3650.000000
               MG      2625.000000
               RJ      3300.000000
               SP      2375.000000
        max    ES      3900.000000
               MG      3100.000000
               RJ      3900.000000
               SP      2500.000000
dtype: float64

In [16]:
df_sede.describe().transpose()['SP']

Vendas  count       2.000000
        mean     2250.000000
        std       353.553391
        min      2000.000000
        25%      2125.000000
        50%      2250.000000
        75%      2375.000000
        max      2500.000000
Name: SP, dtype: float64

In [17]:
arrays = [['São Paulo', 'São Paulo', 'Rio de Janeiro', 'Rio de Janeiro','Minas Gerais','Minas Gerais'],
['Garrafas','Copos','Garrafas','Copos','Garrafas','Copos' ]]
index = pd.MultiIndex.from_arrays(arrays, names=('Estado', 'Produto'))
df1 = pd.DataFrame({'Total Vendido R$': [10000, 35000, 22400, 12890,10880,13900]},index=index)

In [19]:
df1

                         Total Vendido R$
Estado         Produto
São Paulo      Garrafas             10000
               Copos                35000
Rio de Janeiro Garrafas             22400
               Copos                12890
Minas Gerais   Garrafas             10880
               Copos                13900

In [23]:
mult = df1.groupby('Estado',level=0)

In [24]:
mult.mean()

                Total Vendido R$
Estado
Minas Gerais             12390.0
Rio de Janeiro           17645.0
São Paulo                22500.0

In [25]:
mult.max()

                Total Vendido R$
Estado
Minas Gerais               13900
Rio de Janeiro             22400
São Paulo                  35000